Revit 2027 API
BuiltInFailures.ColorFillFailures.OnlyOneColorFillNonPlan Property
 A Color Fill Legend can only be placed in a Floor Plan View or a Section View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OnlyOneColorFillNonPlan { get; }
Public Shared ReadOnly Property OnlyOneColorFillNonPlan As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OnlyOneColorFillNonPlan {
	FailureDefinitionId^ get ();
}
static member OnlyOneColorFillNonPlan : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColorFillFailures Class
Autodesk.Revit.DB Namespace